import { Injectable } from '@angular/core';
import { randFromArray } from '../../../../../lib/math/rand-from-array';

@Injectable({
  providedIn: 'any',
})
export class SimsBuildReactionService {
  private reactions = [
    '😀','😁','😂','🤣','😃','😄','😅','😆','😉','😊',
    '😋','😎','😍','😘','🥰','😚','🙂','🤗','🤩','🤨',
    '😐','😑','🙄','😏','😣','😥','😮','😯','😪','😫',
    '🥱','😛','😜','😝','😒','😓','😔','😕','🙃','🤑',
    '😲','🙁','😖','😞','😟','😤','😢','😭','😦','😧',
    '😨','😩','🤯','😬','😱','😳','🤪','😵','😠','😡',
    '🤬','🤢','🤮','🥳','🥺','🤡','🤭','💩', 
	]

  suggest(): string {
    return randFromArray(this.reactions);
  }
}
